{
  "1.0": {
    "1.1": {
      "Categories": {
        "Technical": {
          "definition": "Security controls implemented through technology and automated systems such as firewalls, encryption, access control systems, and intrusion detection. These controls require minimal human intervention once configured and operate continuously.",
          "examples": ["Firewalls", "Encryption software", "Antivirus", "IDS/IPS", "Multi-factor authentication systems"]
        },
        "Managerial": {
          "definition": "Administrative controls focused on policies, procedures, and organizational governance. Also called administrative controls, these include security policies, risk assessments, security awareness training, and incident response planning that provide the framework for security operations.",
          "examples": ["Security policies", "Risk assessments", "Security training programs", "Incident response plans", "Change management procedures"]
        },
        "Operational": {
          "definition": "Day-to-day procedures and mechanisms implemented by people to ensure security. These controls involve human actions and processes including security guards, awareness training, configuration management, and media protection.",
          "examples": ["Security guards", "Awareness training", "Configuration management", "Backup procedures", "Account reviews"]
        },
        "Physical": {
          "definition": "Tangible barriers and mechanisms that prevent or deter unauthorized physical access to facilities, systems, and assets. These controls protect against physical threats and include fences, locks, badge readers, mantraps, and security cameras.",
          "examples": ["Fences and gates", "Locks", "CCTV cameras", "Mantraps", "Bollards", "Access badges"]
        }
      },
      "Control Types": {
        "Preventive": {
          "definition": "Security measures designed to stop security incidents before they occur by blocking unauthorized access or actions. These are proactive controls that create barriers to threats.",
          "examples": ["Firewalls blocking unauthorized traffic", "Access controls preventing unauthorized entry", "Security awareness training", "Encryption protecting data", "Guards at checkpoints"]
        },
        "Deterrent": {
          "definition": "Controls that discourage potential attackers from attempting an attack by making the target appear difficult or risky. These controls reduce likelihood of threats through psychological means.",
          "examples": ["Warning signs", "Security cameras (visible)", "Guard dogs", "Lighting", "Security awareness posters"]
        },
        "Detective": {
          "definition": "Controls that identify and alert on security incidents during or after they occur. These controls don't prevent incidents but ensure they are discovered and can be responded to promptly.",
          "examples": ["IDS (Intrusion Detection Systems)", "SIEM systems", "Log monitoring", "Security audits", "Motion detectors", "CCTV review"]
        },
        "Corrective": {
          "definition": "Controls that remediate security incidents and restore systems to normal operation after a security event. These controls minimize impact and enable recovery.",
          "examples": ["Antivirus quarantine and removal", "Backup restoration", "System patching", "Incident response procedures", "Account termination"]
        },
        "Compensating": {
          "definition": "Alternative controls implemented when primary controls cannot be used due to technical, operational, or cost constraints. These provide equivalent or better protection through different means to satisfy security requirements.",
          "examples": ["Additional monitoring when encryption can't be used", "Enhanced logging", "Network segmentation as alternative to patching", "Manual reviews when automation fails"]
        },
        "Directive": {
          "definition": "Controls that direct, confine, or control the actions of subjects to ensure compliance with security policies. These specify required or acceptable actions through policies, procedures, and guidelines.",
          "examples": ["Security policies", "Acceptable Use Policies", "Standard operating procedures", "Training requirements", "Posted regulations"]
        }
      }
    },
    "1.2": {
      "Core Principles": {
        "CIA Triad": {
          "full": "Confidentiality, Integrity, Availability",
          "definition": "The three fundamental principles of information security. Confidentiality ensures data is accessible only to authorized parties through encryption and access controls. Integrity ensures data remains accurate and unmodified through hashing and validation. Availability ensures authorized users can access data when needed through redundancy and fault tolerance.",
          "examples": ["Encryption (Confidentiality)", "Hashing (Integrity)", "Redundant systems (Availability)", "Backups (Availability)", "Access controls (Confidentiality)"]
        },
        "Non-repudiation": {
          "definition": "The assurance that someone cannot deny the validity of their actions, the authenticity of their signature, or the origin of data they created. Achieved through digital signatures, audit logs, timestamps, and cryptographic proof that creates irrefutable evidence of actions.",
          "examples": ["Digital signatures", "Audit logs with timestamps", "Email delivery receipts", "Blockchain transactions", "Notarized documents"]
        },
        "AAA Framework": {
          "full": "Authentication, Authorization, and Accounting",
          "definition": "Framework for controlling and tracking user access to network resources. Authentication verifies identity (who you are), Authorization determines access rights (what you can do), and Accounting tracks user activities (what you did). Forms the basis of access control systems.",
          "examples": ["RADIUS servers", "TACACS+", "802.1X", "Kerberos", "OAuth flows"]
        }
      },
      "Zero Trust": {
        "Control Plane": {
          "definition": "The decision-making component of Zero Trust architecture that defines and enforces security policies. Includes the Policy Administrator, Policy Engine, adaptive identity verification, threat scope reduction, and policy-driven access control that collectively determine whether to grant access.",
          "examples": ["Policy engines", "Identity providers", "Threat intelligence feeds", "Risk assessment systems"]
        },
        "Data Plane": {
          "definition": "The enforcement component of Zero Trust architecture where actual access decisions are implemented. Includes the Policy Enforcement Point that allows or denies access based on Control Plane decisions, manages implicit trust zones, and handles Subject/System authentication.",
          "examples": ["Firewalls", "Proxies", "Gateways", "VPN concentrators", "API gateways"]
        },
        "Policy-driven Access": {
          "definition": "Access control approach where decisions are based on comprehensive policies evaluating identity, device posture, location, time, requested resource, and risk level rather than simple network location. Enables dynamic, context-aware access decisions.",
          "examples": ["Conditional access policies", "Risk-based authentication", "Device compliance checks", "Continuous authorization"]
        }
      },
      "Physical Security": {
        "Bollards": {
          "definition": "Short, sturdy vertical posts installed to prevent vehicle access to pedestrian areas or building perimeters. Serve as physical security barriers against vehicle ramming attacks and provide traffic control while allowing pedestrian passage.",
          "examples": ["Fixed bollards protecting building entrances", "Removable bollards for flexible access", "Collapsible security bollards", "Decorative bollards"]
        },
        "Access Control Vestibule": {
          "definition": "Double-door security checkpoint (formerly called mantrap) where two interlocking doors create a small space that only allows one door to be opened at a time. Prevents tailgating, enables authentication verification, and provides a security buffer zone between unsecured and secured areas.",
          "examples": ["Bank vault entrances", "Data center entry points", "Secure facility checkpoints", "Airport security zones"]
        },
        "Fencing": {
          "definition": "Physical barrier perimeter security using chain-link, wrought iron, or specialized security fencing to deter and delay unauthorized access. Height and construction indicate security level: 3-4 ft deters casual trespassers, 6-7 ft is too high to climb easily, 8 ft with barbed wire indicates high security.",
          "examples": ["Chain-link perimeter fencing", "Anti-climb fencing", "Electric fencing", "Barbed wire topping"]
        },
        "Video Surveillance": {
          "definition": "Camera systems (CCTV - Closed Circuit Television) monitoring and recording activity for security purposes. Provides detective control through recording evidence and deterrent control through visible presence. Modern systems include motion detection, facial recognition, and remote monitoring capabilities.",
          "examples": ["IP cameras", "Pan-Tilt-Zoom cameras", "Infrared night vision", "Motion-activated recording", "License plate readers"]
        }
      }
    },
    "1.3": {
      "Business Processes": {
        "Approval Process": {
          "definition": "Formal procedure requiring authorized personnel to review and approve changes before implementation. Ensures changes are legitimate, necessary, and properly vetted. Typically involves multi-level approval based on change risk and impact.",
          "examples": ["Change Advisory Board approval", "Manager authorization", "Security team review", "Emergency change procedures"]
        },
        "Ownership": {
          "definition": "Assignment of accountability and responsibility for systems, data, or processes to specific individuals. Owners make decisions about access, changes, and security requirements. Critical for establishing clear lines of authority and responsibility.",
          "examples": ["System owners", "Data owners", "Process owners", "Application owners"]
        },
        "Impact Analysis": {
          "definition": "Assessment of potential effects a change may have on systems, security, users, and business operations. Evaluates risks, dependencies, and consequences to make informed decisions. Identifies affected systems and stakeholders.",
          "examples": ["Risk assessment", "Dependency mapping", "Business impact evaluation", "Security impact review"]
        },
        "Backout Plan": {
          "definition": "Documented procedure for reversing a change if implementation fails or causes problems. Ensures ability to restore previous stable state quickly. Should be tested and readily available before change implementation.",
          "examples": ["System restore procedures", "Configuration rollback steps", "Database recovery procedures", "Snapshot reversion"]
        }
      },
      "Technical Implications": {
        "Downtime": {
          "definition": "Period when systems or services are unavailable to users, often required during change implementation. Must be scheduled during maintenance windows to minimize business impact. Security changes may require system restarts or service interruptions.",
          "examples": ["Scheduled maintenance windows", "Patch installation downtime", "System upgrade outages", "Emergency maintenance"]
        },
        "Service Restart": {
          "definition": "Stopping and restarting a service to apply changes, clear memory, or resolve issues. Common security implication of applying patches, configuration changes, or security updates. May cause brief service interruption.",
          "examples": ["Web server restart after SSL certificate update", "Database service restart", "Authentication service reload", "Firewall service restart"]
        },
        "Legacy Applications": {
          "definition": "Older software or systems still in use despite newer alternatives being available. Often cannot be easily updated or patched due to compatibility issues, lack of vendor support, or business dependencies. Present significant security challenges and require compensating controls.",
          "examples": ["Unsupported operating systems", "End-of-life software", "Custom legacy systems", "Outdated database versions"]
        }
      }
    },
    "1.4": {
      "PKI": {
        "Public Key": {
          "definition": "Cryptographic key that can be freely shared and distributed. Used to encrypt data (that only the private key can decrypt) or verify digital signatures created with the private key. Part of asymmetric encryption key pair in PKI systems.",
          "examples": ["SSL/TLS certificates", "Email encryption (PGP)", "Digital signature verification", "SSH public keys"]
        },
        "Private Key": {
          "definition": "Cryptographic key that must be kept secret and secure. Used to decrypt data encrypted with the paired public key or create digital signatures. Compromise of private key compromises entire security of the key pair. Must be protected with encryption and access controls.",
          "examples": ["Certificate private keys", "Code signing keys", "Email decryption keys", "SSH private keys"]
        },
        "Key Escrow": {
          "definition": "Practice of storing encryption keys with a trusted third party (escrow agent) to enable key recovery if original keys are lost or for legal/regulatory access. Controversial due to security risks if escrow is compromised. Common in enterprise environments for data recovery.",
          "examples": ["Enterprise key recovery systems", "BitLocker recovery keys", "Certificate key backup", "Encrypted device recovery"]
        }
      },
      "Encryption": {
        "Symmetric": {
          "definition": "Encryption using the same key for both encryption and decryption. Very fast and efficient for large amounts of data but requires secure key distribution. Key must be shared securely between parties. Examples include AES, DES, and 3DES.",
          "examples": ["AES-256 encryption", "Full disk encryption", "VPN tunnels", "Database encryption", "File encryption"]
        },
        "Asymmetric": {
          "definition": "Encryption using a key pair: public key for encryption, private key for decryption (or vice versa for signatures). Solves key distribution problem but slower than symmetric encryption. Often used to exchange symmetric keys securely. Examples include RSA, ECC.",
          "examples": ["RSA encryption", "SSL/TLS key exchange", "PGP email encryption", "Digital signatures", "SSH authentication"]
        },
        "Hashing": {
          "definition": "One-way mathematical function that converts data into a fixed-size output (hash/digest). Cannot be reversed to recover original data. Used for integrity verification and secure password storage. Any change to input produces completely different hash. Examples include SHA-256, MD5 (deprecated).",
          "examples": ["Password hashing (bcrypt)", "File integrity checking (SHA-256)", "Digital signatures", "Blockchain", "Certificate fingerprints"]
        },
        "Digital Signatures": {
          "definition": "Cryptographic proof that a message or document came from a specific sender and hasn't been altered. Created by hashing content and encrypting hash with sender's private key. Recipients verify using sender's public key. Provides authentication, integrity, and non-repudiation.",
          "examples": ["Code signing", "Email signatures (S/MIME)", "PDF document signing", "Software updates", "Certificate signing"]
        }
      },
      "Tools": {
        "TPM": {
          "full": "Trusted Platform Module",
          "definition": "Dedicated microcontroller chip on computer motherboards that provides hardware-based security functions. Stores cryptographic keys, performs encryption operations, provides secure boot verification, and ensures platform integrity. Cannot be tampered with or removed without detection.",
          "examples": ["BitLocker key storage", "Secure Boot verification", "Hardware-based encryption", "Credential storage", "Platform attestation"]
        },
        "HSM": {
          "full": "Hardware Security Module",
          "definition": "Dedicated physical device that generates, stores, and manages cryptographic keys in a tamper-resistant environment. Provides high-security key storage and cryptographic operations for enterprises. FIPS 140-2 certified. Much more powerful than TPM, used for enterprise PKI and high-value transactions.",
          "examples": ["Payment processing key management", "Certificate Authority operations", "Database encryption key storage", "SSL/TLS certificate management"]
        },
        "Key Management System": {
          "definition": "Centralized system for managing cryptographic keys throughout their lifecycle: generation, distribution, storage, rotation, archival, and destruction. Ensures keys are properly protected, audited, and available when needed while maintaining security and compliance.",
          "examples": ["Azure Key Vault", "AWS KMS", "HashiCorp Vault", "Enterprise key management platforms"]
        }
      }
    }
  }
}
